Revit 2027 API
MEPAnalyticalModelData.GetNodeById Method
 Gets the analytical node with the specified id.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPAnalyticalNode GetNodeById(
	int nodeId
)
Public Function GetNodeById (
	nodeId As Integer
) As MEPAnalyticalNode
public:
MEPAnalyticalNode^ GetNodeById(
	int nodeId
)
member GetNodeById :
        nodeId : int -> MEPAnalyticalNode
Parameters
nodeId Int32
 The node identifier, be aware that this identifier may not be sequentially ordered for all analytical nodes.
Return Value
MEPAnalyticalNode
 The returned analytical node.
Exceptions
Exception | Condition
ArgumentException |  The input must be a valid node id.
See Also
Reference
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace